Replaced ASCII Art with proper diagrams
